In [6]:
# Activity 4
# Below is a table that contains the ages of the three Capaciti interns that were accepted to go work at NASA.
# Create a Pandas Dataframe containing this information:

import numpy as np
import pandas as pd

NASA = [['John', 'Doe', '23'], ['Peter', 'Pan', '29'], ['Tinker', 'Bell', '21']] 
    
df = pd.DataFrame(NASA, columns =['col1', 'col2', 'col3'], dtype = float) 
df

     col1  col2  col3
0    John   Doe  23.0
1   Peter   Pan  29.0
2  Tinker  Bell  21.0

In [9]:
# Five years later after the creation of this dataframe the data analyst was working on this data and 
# noticed that she couldnâ€™t make sense of it.

# You have been tasked to rename the columns to make this dataframe readable 
# Below is the list of changes you need to make:
# col1 = Name
# col2 = Surname
# col3 = Age

df.columns = ['Name' if x=='col1' else x for x in df.columns]
df.columns = ['Surname' if x=='col2' else x for x in df.columns]
df.columns = ['Age' if x=='col3' else x for x in df.columns]
df

     Name Surname   Age
0    John     Doe  23.0
1   Peter     Pan  29.0
2  Tinker    Bell  21.0